#include<stdio.h>
#include<locale.h>
#include<iostream>
#include<time.h>
#include<math.h>

using namespace std;
#define size8 8
#define size12 12
char f;

void main()
{
	srand(time(NULL));
	setlocale(LC_ALL, "rus");
	do {
		int N = 0;
		cout << "Выберите задания" << endl;
		cin >> N;
		if (N == 1)
		{
			/*1.	Дан массив. Вывести на экран сначала его неотрицательные элементы, затем отрицательные*/
			int f[10];
			int x;
			for (int i = 0; i < 10; i++)
			{
				cout << "Введите число индекса - f[" << i << "]" << endl;
				cin >> x;
				f[i] = x;
			}
			cout << "неотрицательные" << endl;
			for (int i = 0; i < 10; i++)
			{
				if (f[i] > 0)
					cout << " f[" << i << "] = " << f[i] << endl;
			}
			cout << "отрицательные" << endl;
			for (int i = 0; i < 10; i++)
			{
				if (f[i] < 0) 
					cout << " f[" << i << "] = " << f[i] << endl;
			}
		}
		else if (N == 2)
		{
			/*2.	В массиве хранится информация о количестве побед, одержанных 20 футбольными командами. Определить номера команд, имеющих меньше трех побед.*/
			int f[20];
			cout << "Таблица" << endl;
			for ( int i = 0;  i <20;  i++)
			{
				f[i] = 1 + rand() % 11;
				cout << " команда " << i+1 << "выйграла = "<< f[i] << endl;
			}
			cout << "команды имеющие меньше 3-х побед :" << endl;
			for (int i = 0; i <20; i++)
			{
				if (f[i] < 3)
					cout <<"команда номер "<< i << endl;
			}
		}
		else if (N == 3)
		{
			//3.	Ввести массив, состоящий из 14 элементов целого типа.Найти количество элементов четных по значению.
			int f[14];
			for (int i = 0; i <14; i++)
			{
				f[i] = 1 + rand() % 10;
			}
			cout << "четных по значению" << endl;
			for (int i = 0; i <14; i++)
			{
				if((f[i]%2)==0)
					cout << " f[" << i << "] = " << f[i] << endl;
			}

		}
		else if (N == 4)
		{
			/*4.	Ввести массив, состоящий из 12 элементов целого типа. Получить новый массив, заменив значение пятого элемента среднеарифметическим исходного массива*/
			int f[12];
			int aum=0;
			for (int i=0;i<12;i++)
			{
				f[i] = 1 + rand() % 10;
				cout << " f[" << i << "] = " << f[i] << endl;
				aum += f[i];
			}
			cout << "среднее арифметическое" << endl;
			cout << "(";
			for (int i = 0; i<12; i++)
			{
				cout << "f[" << i << "] ";
				if (i < 11)
					cout << "+";
			}
			cout << ")/12= " << aum / 12 << endl;
			f[5] = aum / 12;
			cout << "пятый элемент теперь равен " << "f[5]]= " << f[5] << endl;;

		}
		else if (N == 5)
		{
			//5.	Задан массив, состоящий из 15 элементов вещественного типа. Определить количество элементов, значения которых больше первого элемента
			float f[14];
			for (int i = 0; i<15; i++)
			{
				f[i] = 1.1 + rand() % 15;
				cout << " f[" << i << "] = " << f[i] << endl;
			}
			for (int i = 0; i < 15; i++)
			{
				if(f[i]>f[0])
					cout << " f[" << i << "] = " << f[i] << endl;
			}
		}
	
		cout << "Хотите продолжить проверять" << endl;
		cout << "y-da    n-no" << endl;
			cin >> f;
	} while (f == 'y');
}